// Να κατασκευαστεί κλάση employee που θα περιέχει τα ακόλουθα μέλη δεδομένα
// ID: Τυχαίος αριθμός
// Name: όνομα υπαλλήλου
// Lastname: επώνυμο υπαλλήλου
// Salary: μισθός υπαλλήλου
// child_number

// 1. Να δημιουργηθεί κατασκευαστεί κατασκευαστής που θα αρχικοποιεί τα μέλη της κλάσης με βάση τις παραμέτρους που θα δέχεται
// 2. Να υλοποιηθούν setters και getters για όλα τα μέλη δεδομένα της κλάσης
// 3. Να υλοποιηθεί συνάρτηση increase_salary(percent) που θα αυξάνει τον μισθό ενός υπαλλήλου με βάση την παράμετρο ποσοστο.
// 4. Να υλοποιηθεί συνάρτηση annual_salary που θα υπολογίζει τον ετήσιο μισθό ενός υπαλλήλου.
// Ο μισθός υπολογίζεται ως εξής:
//     Τους Μονούς μήνες(1,3,5,....) υπάρχει παρακράτηση φόρου 5%
//     Τους ζυγούς μήνες(2,4,6) υπάρχει παρακράτηση φόρου 6% 
//     Αν ένας υπάλληλος έχει 1 παιδί η ετήσια επιστροφή φόρου είναι 1%
//     Αν ένας υπάλληλος έχει 2 παιδί η ετήσια επιστροφή φόρου είναι 2%
//     Αν ένας υπάλληλος έχει 3 παιδιά η ετήσια επιστροφή φόρου είναι 4%

// 5. Να κατασκευαστεί συνάρτηση display που θα εμφανίζει τα στοιχεία ενός υπαλλήλου καθώς και τον συνολικό μισθό

// Α. Στην κύρια συνάρτηση, Να δημιουργηθεί δυναμικός πίνακας με 10 υπαλλήλους
// Β. Όσοι υπάλληλοι έχουν ετήσιο μισθό κάτω από 10000 να υπάρχει αύξηση μισθού κατά 10%
// Γ. Να εμφανιστούν τα στοιχεία όλων των υπαλλήλων.
// ΠΡΟΕΡΕΤΙΚΑ: Να κατασκευαστεί συνάρτηση η οποία θα αποθηκεύει τα δεδομένα των υπαλλήλων σε ένα αρχείο.

#include <iostream>
using namespace std;

class Employee
{

};

int main()
{

}
